# Limpieza de los `DataFrames` relacionados con educación

In [20]:
import pandas as pd
from scripts.translate import *

In [22]:
df = get_df_translated("Expected years of schooling (years).csv")

In [26]:
df.head()

,HDI Rank,Country,1990,Unnamed: 3,1991,Unnamed: 5,1992,Unnamed: 7,1993,Unnamed: 9,...,2015,Unnamed: 53,2016,Unnamed: 55,2017,Unnamed: 57,2018,Unnamed: 59,2019,Unnamed: 61
0,169,Afganistán,2.6,NaN,2.9,NaN,3.2,NaN,3.6,NaN,...,10.2,NaN,10.3,NaN,10.1,NaN,10.1,NaN,10.2,a
1,69,Albania,11.6,NaN,11.8,NaN,10.7,NaN,10.1,NaN,...,15.1,NaN,14.8,NaN,14.8,NaN,14.7,NaN,14.7,a
2,91,Argelia,9.6,NaN,9.7,NaN,9.8,NaN,9.8,NaN,...,14.2,NaN,14.2,NaN,14.4,NaN,14.5,NaN,14.6,a
3,36,Andorra,10.8,NaN,10.8,NaN,10.8,NaN,10.8,NaN,...,13.1,NaN,13.3,NaN,13.0,NaN,13.3,NaN,13.3,"a,b"
4,148,Angola,3.4,NaN,3.3,NaN,3.2,NaN,3.7,NaN,...,11.0,NaN,11.4,NaN,11.8,NaN,11.8,NaN,11.8,"a,c"

In [27]:
df.tail()

,HDI Rank,Country,1990,Unnamed: 3,1991,Unnamed: 5,1992,Unnamed: 7,1993,Unnamed: 9,...,2015,Unnamed: 53,2016,Unnamed: 55,2017,Unnamed: 57,2018,Unnamed: 59,2019,Unnamed: 61
188,113,Venezuela (República Bolivariana de),10.5,NaN,10.7,NaN,10.8,NaN,10.8,NaN,...,14.0,NaN,13.6,NaN,12.8,NaN,12.8,NaN,12.8,"a,d"
189,117,Vietnam,7.8,NaN,8.1,NaN,8.4,NaN,8.7,NaN,...,12.7,NaN,12.7,NaN,12.7,NaN,12.7,NaN,12.7,"a,d"
190,179,Yemen,7.5,NaN,7.5,NaN,7.6,NaN,7.6,NaN,...,8.7,NaN,8.7,NaN,8.7,NaN,8.7,NaN,8.8,"a,d"
191,146,Zambia,7.5,NaN,7.7,NaN,8.0,NaN,8.2,NaN,...,11.1,NaN,11.2,NaN,11.3,NaN,11.4,NaN,11.5,"a,c"
192,150,Zimbabue,9.8,NaN,10.2,NaN,9.8,NaN,9.8,NaN,...,10.3,NaN,10.4,NaN,10.5,NaN,10.5,NaN,11.0,"a,h"

In [34]:
df[df["2019"] == ".."]

Empty DataFrame
Columns: [HDI Rank, Country, 1990, Unnamed: 3, 1991, Unnamed: 5, 1992, Unnamed: 7, 1993, Unnamed: 9, 1994, Unnamed: 11, 1995, Unnamed: 13, 1996, Unnamed: 15, 1997, Unnamed: 17, 1998, Unnamed: 19, 1999, Unnamed: 21, 2000, Unnamed: 23, 2001, Unnamed: 25, 2002, Unnamed: 27, 2003, Unnamed: 29, 2004, Unnamed: 31, 2005, Unnamed: 33, 2006, Unnamed: 35, 2007, Unnamed: 37, 2008, Unnamed: 39, 2009, Unnamed: 41, 2010, Unnamed: 43, 2011, Unnamed: 45, 2012, Unnamed: 47, 2013, Unnamed: 49, 2014, Unnamed: 51, 2015, Unnamed: 53, 2016, Unnamed: 55, 2017, Unnamed: 57, 2018, Unnamed: 59, 2019, Unnamed: 61]
Index: []

[0 rows x 62 columns]